ext_alsav/DataProcessors/ВыгрузкаОстатковCSV.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаОстатковCSV</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ext_alsav/AccumulationRegisters/СвободныеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СвободныеОстатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРезервеСоСклада</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРезервеПодЗаказ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ext_alsav/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/DataProcessors/ВыгрузкаОстатковCSV/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Выгрузить(Команда)
	// Вставить содержимое обработчика.
	
	ВыгрузитьВФайл(Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)	
	
	
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = НСтр("ru='Выберите файл, куда записать остатки'");
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Расширение = "xml";
	Диалог.Фильтр = НСтр("ru='CSV (*.csv)|*.csv'");

	ДополнительныеПараметры = Новый Структура;
	ОписаниеОповещенияПослеВыбора = Новый ОписаниеОповещения("Обработчик_Выгрузки", ЭтаФорма, ДополнительныеПараметры);

	Диалог.Показать(ОписаниеОповещенияПослеВыбора);

		
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_Выгрузки(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт 

	ТипМассив = Тип("Массив");

	Если (ТипЗнч(ВыбранныеФайлы) = ТипМассив)
			И (ВыбранныеФайлы.Количество() > 0) Тогда

		ИмяФайла = ВыбранныеФайлы[0];
		Если НЕ ПустаяСтрока(ИмяФайла) Тогда
			
			Если ЗначениеЗаполнено(ЭтаФорма.ГруппаНоменклатуры) Тогда
				отбор = Новый Структура("ГруппаНоменклатуры",ГруппаНоменклатуры);
			Иначе
				отбор = неопределено;
			конецЕсли;
			данные = ПолучитьОстатки(отбор);
			
			
			текстовыйФайл = неопределено;
			
			Для Каждого стр из  данные Цикл
				Если ЛОЖЬ Тогда стр = Новый Структура(); КонецЕсли;
				
				Если текстовыйФайл = Неопределено Тогда
					текстовыйФайл = Новый ТекстовыйДокумент();
					текстовыйФайл.ДобавитьСтроку(СформироватьСтрокуЗаголовок(стр));
				КонецЕсли;
				текстовыйФайл.ДобавитьСтроку(СформироватьСтрокуДанные(стр));
			КонецЦикла;
			текстовыйФайл.Записать(ИмяФайла);
			
			Сообщить("Файл сформирован: "+ИмяФайла)
		КонецЕсли;
	КонецЕсли;
 КонецПроцедуры

 
 &НаКлиенте
 Функция СформироватьСтрокуЗаголовок(стр)
	 результ = "";
	 
	 Если ЛОЖЬ Тогда стр = Новый Структура(); КонецЕсли;
	 Для Каждого эл из стр Цикл
		 результ = результ + ?(ЗначениеЗаполнено(результ),";","")+эл.Ключ;
	 конецЦикла;	 
	 Возврат результ;
 КонецФункции
 
 
  &НаКлиенте
 Функция СформироватьСтрокуДанные(стр)
	 результ = "";
	 
	 Если ЛОЖЬ Тогда стр = Новый Структура(); КонецЕсли;
	 Для Каждого эл из стр Цикл
		 результ = результ + ?(ЗначениеЗаполнено(результ),";","")+эл.Значение;
	 конецЦикла;	 
	 Возврат результ;

 КонецФункции


&НаСервереБезконтекста
Функция ПолучитьОстатки(отбор)
	
	видЦеныНаименование = "Отпускная цена (с учетом НДС)";
	складНаименование = "Основной склад";
	видЦены = Справочники.ВидыЦен.НайтиПоНаименованию(видЦеныНаименование);
	склад = Справочники.Склады.НайтиПоНаименованию(складНаименование);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	остатки.Номенклатура КАК Номенклатура,
				   |	остатки.Номенклатура.Артикул КАК Артикул,
				   |	CASE КОГДА остатки.Номенклатура.ВесЗнаменатель > 0 ТОГДА остатки.Номенклатура.ВесЧислитель / остатки.Номенклатура.ВесЗнаменатель ИНАЧЕ 0 КОНЕЦ КАК  Вес,
				   |	CASE КОГДА остатки.Номенклатура.ОбъемЗнаменатель > 0 ТОГДА остатки.Номенклатура.ОбъемЧислитель / остатки.Номенклатура.ОбъемЗнаменатель ИНАЧЕ 0 КОНЕЦ КАК  Объем,
				   |	Рек_Серия.Значение КАК Серия,
				   |	остатки.Характеристика КАК Характеристика,	               
	               |	остатки.Склад КАК Склад,
	               |	ЕСТЬNULL(остатки.ВНаличииОстаток, 0) - ЕСТЬNULL(остатки.ВРезервеПодЗаказОстаток, 0) - ЕСТЬNULL(остатки.ВРезервеСоСкладаОстаток, 0) КАК Доступно,
	               |	ЕСТЬNULL(остатки.ВНаличииОстаток, 0) КАК ВНаличии,
	               |	ЕСТЬNULL(остатки.ВРезервеПодЗаказОстаток, 0) КАК ВРезервеПодЗаказОстаток,
	               |	ЕСТЬNULL(остатки.ВРезервеСоСкладаОстаток, 0) КАК ВРезервеСоСкладаОстаток,
	               |	ЕСТЬNULL(цены.Цена, 0) КАК Цена,
	               |	остатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ИЗ
	               |	РегистрНакопления.СвободныеОстатки.Остатки(, Склад = &Склад) КАК остатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦены) КАК цены
	               |		ПО остатки.Номенклатура = цены.Номенклатура
	               |			И остатки.Характеристика = цены.Характеристика
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты Рек_Серия 
				   |		ПО Рек_Серия.Ссылка = остатки.Номенклатура И 
				   |			Рек_Серия.Свойство.Заголовок = ""Серия""
	               |ГДЕ
	               |	1 = 1";
	
	
	Запрос.УстановитьПараметр("ВидЦены",видЦены);
	Запрос.УстановитьПараметр("Склад",склад);
	
	Если отбор <> неопределено Тогда
		Если ЗначениеЗаполнено(отбор.ГруппаНоменклатуры) Тогда
			Запрос.УстановитьПараметр("ГруппаНоменклатуры",отбор.ГруппаНоменклатуры);
			Запрос.Текст = Запрос.Текст + " И остатки.Номенклатура В ИЕРАРХИИ(&ГруппаНоменклатуры) ";	
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	рез = Запрос.Выполнить().Выбрать();
	
	результ = новый Массив;
	поляСтруктуры = "Серия, Артикул, Номенклатура, Характеристика, ЕдиницаИзмерения, Цена, Дата, ВидЦен, Доступно, Вес, Объем";
	
	дата=Формат(ТекущаяДата(),"ДФ=дд.ММ.гггг");
	
	Пока Рез.Следующий() Цикл
		
		Если Рез.Доступно <= 0 Тогда
			продолжить;
		конецЕсли;
		
		стр = Новый Структура(поляСтруктуры);
		
		ЗаполнитьЗначенияСвойств(стр, рез);
		стр.Дата = дата;
		стр.ВидЦен = видЦеныНаименование;	
		
		
		стр.Цена = Формат(стр.Цена,"ЧРД=.; ЧГ=0");
		стр.Доступно = Формат(стр.Доступно,"ЧРД=.; ЧГ=0");
		
		
		результ.Добавить(стр);
	КонецЦикла;	
	Возврат результ;
КонецФункции
